Revit 2024 API
ExternalFileUtils.GetAllExternalFileReferences Method
 Gets the ids of all elements which are external file references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static ICollection<ElementId> GetAllExternalFileReferences(
	Document aDoc
)
Visual Basic
Public Shared Function GetAllExternalFileReferences ( _
	aDoc As Document _
) As ICollection(Of ElementId)
Visual C++
public:
static ICollection<ElementId^>^ GetAllExternalFileReferences(
	Document^ aDoc
)
Parameters
aDoc
Type: Autodesk.Revit.DB.Document
 A Revit Document.
Return Value
 The ids of all elements which are external file references.
Remarks
 This function will not return the ids of nested Revit links; it only returns top-level references.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExternalFileUtils Class
Autodesk.Revit.DB Namespace